; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-17)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl3)
	(at plane2 city2)
	(fuel-level plane2 fl5)
	(at plane3 city1)
	(fuel-level plane3 fl1)
	(at plane4 city2)
	(fuel-level plane4 fl3)
	(at plane5 city1)
	(fuel-level plane5 fl2)
	(at plane6 city1)
	(fuel-level plane6 fl2)
	(at plane7 city4)
	(fuel-level plane7 fl6)
	(at person1 city3)
	(at person2 city2)
	(at person3 city4)
	(at person4 city0)
	(at person5 city2)
	(at person6 city1)
	(at person7 city3)
	(at person8 city0)
	(at person9 city4)
	(at person10 city3)
	(at person11 city3)
	(at person12 city3)
	(at person13 city1)
	(at person14 city1)
	(at person15 city3)
	(at person16 city3)
	(at person17 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city3)
	(at plane4 city4)
	(at plane6 city4)
	(at person1 city0)
	(at person2 city3)
	(at person3 city3)
	(at person4 city3)
	(at person5 city0)
	(at person6 city4)
	(at person7 city3)
	(at person8 city1)
	(at person9 city4)
	(at person10 city0)
	(at person11 city4)
	(at person12 city1)
	(at person13 city1)
	(at person14 city2)
	(at person15 city4)
	(at person16 city1)
	(at person17 city0)
	))

)

; plan
1. (board person3 plane7 city4)
   deleted: (at person3 city4)
   added: (in person3 plane7)
   goals met: 4 of 20
2. (zoom plane7 city4 city3 fl6 fl5 fl4)
   deleted: (at plane7 city4) (fuel-level plane7 fl6)
   added: (at plane7 city3) (fuel-level plane7 fl4)
   goals met: 4 of 20
3. (debark person3 plane7 city3)
   deleted: (in person3 plane7)
   added: (at person3 city3)
   goals met: 5 of 20
4. (board person16 plane7 city3)
   deleted: (at person16 city3)
   added: (in person16 plane7)
   goals met: 5 of 20
5. (board person15 plane7 city3)
   deleted: (at person15 city3)
   added: (in person15 plane7)
   goals met: 5 of 20
6. (board person12 plane7 city3)
   deleted: (at person12 city3)
   added: (in person12 plane7)
   goals met: 5 of 20
7. (board person11 plane7 city3)
   deleted: (at person11 city3)
   added: (in person11 plane7)
   goals met: 5 of 20
8. (board person10 plane7 city3)
   deleted: (at person10 city3)
   added: (in person10 plane7)
   goals met: 5 of 20
9. (zoom plane7 city3 city1 fl4 fl3 fl2)
   deleted: (at plane7 city3) (fuel-level plane7 fl4)
   added: (at plane7 city1) (fuel-level plane7 fl2)
   goals met: 5 of 20
10. (debark person16 plane7 city1)
   deleted: (in person16 plane7)
   added: (at person16 city1)
   goals met: 6 of 20
11. (debark person12 plane7 city1)
   deleted: (in person12 plane7)
   added: (at person12 city1)
   goals met: 7 of 20
12. (zoom plane7 city1 city4 fl2 fl1 fl0)
   deleted: (at plane7 city1) (fuel-level plane7 fl2)
   added: (at plane7 city4) (fuel-level plane7 fl0)
   goals met: 7 of 20
13. (refuel plane7 city4 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 7 of 20
14. (debark person15 plane7 city4)
   deleted: (in person15 plane7)
   added: (at person15 city4)
   goals met: 8 of 20
15. (debark person11 plane7 city4)
   deleted: (in person11 plane7)
   added: (at person11 city4)
   goals met: 9 of 20
16. (fly plane7 city4 city0 fl1 fl0)
   deleted: (at plane7 city4) (fuel-level plane7 fl1)
   added: (at plane7 city0) (fuel-level plane7 fl0)
   goals met: 9 of 20
17. (debark person10 plane7 city0)
   deleted: (in person10 plane7)
   added: (at person10 city0)
   goals met: 10 of 20
18. (zoom plane6 city1 city4 fl2 fl1 fl0)
   deleted: (at plane6 city1) (fuel-level plane6 fl2)
   added: (at plane6 city4) (fuel-level plane6 fl0)
   goals met: 11 of 20
19. (zoom plane4 city2 city3 fl3 fl2 fl1)
   deleted: (at plane4 city2) (fuel-level plane4 fl3)
   added: (at plane4 city3) (fuel-level plane4 fl1)
   goals met: 11 of 20
20. (board person1 plane4 city3)
   deleted: (at person1 city3)
   added: (in person1 plane4)
   goals met: 11 of 20
21. (board person14 plane5 city1)
   deleted: (at person14 city1)
   added: (in person14 plane5)
   goals met: 11 of 20
22. (zoom plane5 city1 city2 fl2 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl2)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 11 of 20
23. (debark person14 plane5 city2)
   deleted: (in person14 plane5)
   added: (at person14 city2)
   goals met: 12 of 20
24. (board person6 plane3 city1)
   deleted: (at person6 city1)
   added: (in person6 plane3)
   goals met: 12 of 20
25. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 12 of 20
26. (debark person6 plane3 city4)
   deleted: (in person6 plane3)
   added: (at person6 city4)
   goals met: 13 of 20
27. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   goals met: 13 of 20
28. (board person2 plane2 city2)
   deleted: (at person2 city2)
   added: (in person2 plane2)
   goals met: 13 of 20
29. (zoom plane2 city2 city0 fl5 fl4 fl3)
   deleted: (at plane2 city2) (fuel-level plane2 fl5)
   added: (at plane2 city0) (fuel-level plane2 fl3)
   goals met: 13 of 20
30. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   goals met: 14 of 20
31. (zoom plane2 city0 city3 fl3 fl2 fl1)
   deleted: (at plane2 city0) (fuel-level plane2 fl3)
   added: (at plane2 city3) (fuel-level plane2 fl1)
   goals met: 14 of 20
32. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   goals met: 15 of 20
33. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   goals met: 15 of 20
34. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   goals met: 15 of 20
35. (zoom plane1 city0 city1 fl3 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 15 of 20
36. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   goals met: 16 of 20
37. (fly plane1 city1 city3 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 17 of 20
38. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   goals met: 18 of 20
39. (fly plane4 city3 city0 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 18 of 20
40. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 18 of 20
41. (debark person1 plane4 city0)
   deleted: (in person1 plane4)
   added: (at person1 city0)
   goals met: 19 of 20
42. (fly plane4 city0 city4 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 20 of 20
